<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Okta Verify and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.aanklewicz.munki.OktaVerify</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>DocuSign Edit</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>Phase0</string>
			</array>
			<key>category</key>
			<string>Internal Tools</string>
			<key>description</key>
			<string>Okta Verify is a lightweight app that allows you to securely access your apps via 2-step verification, ensuring that you, and only you, can access your app accounts.

While you access your apps, you’ll choose a 2-step verification method provided by Okta Verify to finish signing in. You can verify your identity using a push notification sent to your device (if enabled by your organization), a temporary 6-digit code, or biometrics (if enabled by your organization).

We do request permission to use your device camera so that you can scan a QR code when you enroll your device with Okta.

App Features

Register your device with one or more Okta accounts that require Okta Verify for verification.
Enroll your device in Okta to enable 2-factor verification using 6-digit one-time passcode.
Enroll your device in Okta for 2-factor verification using push notifications (if enabled by your organization).
Enroll on-device biometrics to use to sign in to an app (if enabled by or organization).
Add 2-factor verification for non-Okta apps that support or require the use of one-time passcodes.
Note: Some functionality is available only if enabled by your IT organization. For more information, check Okta Verify docs at - https://help.okta.com/en/prod/end-user/Content/Topics/end-user/ov-overview.htm?cshid=csh-user-ov-overview.</string>
			<key>developer</key>
			<string>Okta, Inc.</string>
			<key>display_name</key>
			<string>Okta Verify</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.aanklewicz.download.OktaVerify</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
