<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Orka from MacStadium.</string>
        <key>Identifier</key>
        <string>com.github.aanklewicz.download.MacStadiumOrka</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Orka</string>
            <key>SEARCH_URL</key>
            <string>https://support.macstadium.com/hc/en-us/articles/28347376278299-Tools-Integrations</string>
        </dict>
        <key>MinimumVersion</key>
	    <string>1.0.0</string>
        <key>Process</key>
        <array> 
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>cask_name</key>
                    <string>orka3</string>
                </dict>
                <key>Processor</key>
                <string>com.github.ahousseini-recipes.SharedProcessors/HomebrewCaskURL</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: MacStadium Inc (23KP83Z488)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                    <key>input_path</key>
                    <string>%pathname%</string>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
        </array>
    </dict>
</plist>
