<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of ObserveAI Screen Recorder.</string>
        <key>Identifier</key>
        <string>com.github.aanklewicz.download.ObserveAIScreenRecorder</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>ObserveAIScreenRecorder</string>
            <key>ARCH</key>
            <string>x86_64</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
                <key>Arguments</key>
                <dict>
                    <key>input_string</key>
                    <string>%ARCH%</string>
                    <key>find</key>
                    <string>x86_64</string>
                    <key>replace</key>
                    <string>x64</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://app.observe.ai/screenrecorder</string>
                    <key>re_pattern</key>
                    <string>"(https://agent-screen-recorder.s3.us-west-2.amazonaws.com/setup/darwin/%output_string%/Observe.AI%20Screen%20Recorder-(?P&lt;version&gt;[\d\.]+)-%output_string%.pkg)"</string>
                    <key>result_output_var_name</key>
                    <string>url</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%-%version%-%ARCH%.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: Z21 Labs, Inc. (377DKSV63J)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                    <key>input_path</key>
                    <string>%pathname%</string>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
        </array>
    </dict>
</plist>
