<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of ObserveAI Screen Recorder.</string>
        <key>Identifier</key>
        <string>com.github.aanklewicz.download.ObserveAIScreenRecorder</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>ObserveAIScreenRecorder</string>
            <key>ARCH</key>
            <string>x64</string>
            <key>DOWNLOAD_JSON_URL</key>
            <string>https://kong.observe.ai/v1/screen-recording/app-versions/latest-mac</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%DOWNLOAD_JSON_URL%</string>
                    <key>re_pattern</key>
                    <string>%ARCH%_pkg_download_url"\s*:\s*"([^"]+\.pkg)</string>
                    <key>result_output_var_name</key>
                    <string>found_url</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
                <key>Arguments</key>
                <dict>
                    <key>find</key>
                    <string> </string>
                    <key>input_string</key>
                    <string>%found_url%</string>
                    <key>replace</key>
                    <string>%20</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%output_string%</string>
                    <key>filename</key>
                    <string>%NAME%-%ARCH%.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>com.github.grahampugh.recipes.commonprocessors/PkgInfoReader</string>
                <key>Arguments</key>
                <dict>
                    <key>source_pkg</key>
                    <string>%pathname%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCopier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_pkg</key>
                    <string>%pathname%</string>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%-%ARCH%.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: Z21 Labs, Inc. (377DKSV63J)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                    <key>input_path</key>
                    <string>%pathname%</string>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
        </array>
    </dict>
</plist>
