<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for SonicPi

For the ARCH_TYPE variable please use Mac-x64 for Intel downloads and Mac-arm64 for Apple Silicon downloads</string>
    <key>Identifier</key>
    <string>com.github.aanklewicz.download.sonicpi</string>
    <key>Input</key>
    <dict>
        <key>ARCH_TYPE</key>
        <string></string>
        <key>NAME</key>
        <string>SonicPi</string>
        <key>PRERELEASE</key>
        <string></string>
        <key>URL</key>
        <string>https://sonic-pi.net/</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Comment</key>
            <string>If the ARCH_TYPE does not equal a wanted value, stop the recipe.</string>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>"%ARCH_TYPE%" != "Mac-x64" AND "%ARCH_TYPE%" != "Mac-arm64"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>\"(https://sonic-pi\.net/files/releases/.*?/Sonic-Pi-for-%ARCH_TYPE%-.*?.dmg)\"</string>
                <key>result_output_var_name</key>
                <string>url</string>
                <key>url</key>
                <string>https://github.com/sonic-pi-net/sonic-pi/releases/latest</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Sonic Pi.app</string>
                <key>requirement</key>
                <string>identifier "net.sonic-pi.app" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = MM65S3L4NG</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
