<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for SonicPi

For the ARCH_TYPE variable please use "Intel-Mac-x64" for Intel downloads and "Mac-arm64" for Apple Silicon downloads</string>
    <key>Identifier</key>
    <string>com.github.aanklewicz.download.sonicpi</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SonicPi</string>
        <key>URL</key>
        <string>https://sonic-pi.net/</string>
        <key>ARCH_TYPE</key>
        <string>Mac-arm64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%URL%</string>
                <key>re_pattern</key>
                <string>(files/releases/v([0-9]+(\.[0-9]+)+)/Sonic-Pi-for-%ARCH_TYPE%-v([0-9]+(-[0-9]+)+)\.dmg)</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%URL%%match%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Sonic Pi.app</string>
                <key>requirement</key>
                <string>identifier "net.sonic-pi.app" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = MM65S3L4NG</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
