<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest SonicPi zip and builds a package.</string>
    <key>Identifier</key>
    <string>com.github.aanklewicz.pkg.sonicpi</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SonicPi</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.aanklewicz.download.sonicpi</string>
    <key>Process</key>
    <array>
         <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
    </array>
</dict>
</plist>
