<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest SonicPi and imports into Munki.

For the SUPPORTED_ARCH variable use "x86_64" for Intel and "arm64" for Apple Silicon.</string>
    <key>Identifier</key>
    <string>com.github.aanklewicz.munki.sonicpi</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SonicPi</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>SUPPORTED_ARCH</key>
        <string></string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Multimedia</string>
            <key>description</key>
            <string>A free live coding synth for everyone originally designed to support computing and music lessons within schools. Use code to compose and perform in classical and contemporary styles ranging from Canons to Dubstep.</string>
            <key>developer</key>
            <string>Sam Aaron and the Sonic Pi Core Team</string>
            <key>display_name</key>
            <string>SonicPi</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>supported_architectures</key>
            <array>
                <string>%SUPPORTED_ARCH%</string>
            </array>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.aanklewicz.download.sonicpi</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
