<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for SonicPi</string>
    <key>Identifier</key>
    <string>com.github.aanklewicz.download.SonicPi</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SonicPi</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://sonic-pi.net/</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;/files/releases/.*?/Sonic-Pi-for-Mac-.*?.dmg)</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>