<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Plex Media Player</string>
	<key>Identifier</key>
	<string>com.github.aanklewicz.download.PlexForMac</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PlexForMac</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(https://downloads.plex.tv/plex-desktop/[0-9\.]+-[a-z0-9]+/macos/Plex-[0-9\.]+-[a-z0-9]+-x86_64.dmg)</string>
				<key>result_output_var_name</key>
				<string>url</string>
				<key>url</key>
				<string>https://plex.tv/api/downloads/6.json</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Plex.app</string>
				<key>requirements</key>
				<string>anchor trusted and identifier "tv.plex.desktop"</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
