<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Plex Media Player</string>
	<key>Identifier</key>
	<string>com.github.aanklewicz.download.PlexForMac</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PlexForMac</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
		  <key>Processor</key>
		  <string>PlexForMacURLProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
				<key>Processor</key>
				<string>Unarchiver</string>
				<key>Arguments</key>
				<dict>
						<key>archive_path</key>
						<string>%pathname%</string>
						<key>destination_path</key>
						<string>%RECIPE_CACHE_DIR%/%NAME%</string>
						<key>purge_destination</key>
						<true/>
				</dict>
		</dict>
		<dict>
			<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
						<key>input_path</key>
						<string>%RECIPE_CACHE_DIR%/%NAME%/Plex.app</string>
						<key>requirement</key>
						<string>anchor trusted and identifier "tv.plex.desktop"</string>
				</dict>
		</dict>
	</array>
</dict>
</plist>
