<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Nudge Logger release and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.aanklewicz.munki.NudgeLogger</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>NudgeLogger</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Nudge</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array/>
            <key>catalogs</key>
            <array>
                <string>Phase0</string>
            </array>
            <key>category</key>
            <string>Configuration Management</string>
            <key>description</key>
            <string>Nudge is a Swift application for enforcing macOS updates. Nudge Logger saves the logs.</string>
            <key>developer</key>
            <string>Erik Gomez</string>
            <key>display_name</key>
            <string>Nudge Logger</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.aanklewicz.download.NudgeLogger</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
